---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpaceComposednameParam
source: html/ded99d2d-6975-3504-7ca8-5dfd335f6d45.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpaceComposednameParam Property

"Composed Name"

## Syntax (C#)
```csharp
public static ForgeTypeId SpaceComposednameParam { get; }
```